EDT/УТ/src/AccumulationRegisters/новаОстаткиГСМ/новаОстаткиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>новаОстаткиГСМ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПутевойЛист</name>
    <type>
      <types>DocumentRef.новаПутевойЛист</types>
    </type>
  </attributes>
  <dimensions>
    <name>Бак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/новаНормыРасходаГСМ/новаНормыРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаНормыРасходаГСМ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЛинейнаяНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаИзменениеСобственногоВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаМоточас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЗапуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОперацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЕздку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МаркаТранспорт</name>
    <type>
      <types>CatalogRef.новаМаркиТранспорта</types>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГСМ</name>
    <type>
      <types>CatalogRef.новаНоменклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/новаПутевойЛист/новаПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаПутевойЛист</name>
  <registerRecords>AccumulationRegister.новаОстаткиГСМ</registerRecords>
  <registerRecords>AccumulationRegister.новаРасходГСМ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.новаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрВыезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрВозвращения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ1</name>
    <type>
      <types>CatalogRef.новаНоменклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ2</name>
    <type>
      <types>CatalogRef.новаНоменклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокПриВыезде1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокПриВыезде2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выдано1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выдано2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп1</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп3</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.новаРежимРаботыПЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдатьГорючее</name>
    <type>
      <types>CatalogRef.новаНоменклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдатьКоличествоГорючего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКилометроТонн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМоточасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЕздок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГСМ</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Бак</name>
      <type>
        <types>CatalogRef.новаБакиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПриВыезде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выдано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходПоНорме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПриВозвращении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.новаКонтрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытияС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОтправленияС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПогрузки</name>
      <type>
        <types>CatalogRef.новаАдреса</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРазгрузки</name>
      <type>
        <types>CatalogRef.новаАдреса</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Груз</name>
      <type>
        <types>DocumentRef.новаГруз</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕздок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/CommonModules/новаУчетГСМ/Module.bsl
// Функция возвращает выборку остатков ГСМ для баков, заданных в списке
//
// Параматры:
//  Дата   - дата, на которую требуется получить выборку остатков
//  мсБаки - <Массив> - массив баков транспорта, для которых требуется сформировать выборку
//
// Возвращаемое значение:
//  <ВыборкаИзРезультатаЗапроса>
//
Функция ПолучитьВыборкуОстатковГСМ(МоментВремени, мсБаки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Баки",мсБаки);
	Запрос.УстановитьПараметр("Дата",МоментВремени);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	новаОстаткиГСМОстатки.Бак,
	|	СУММА(новаОстаткиГСМОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(новаОстаткиГСМОстатки.СтоимостьОстаток) КАК СтоимостьОстаток
	|ИЗ
	|	РегистрНакопления.новаОстаткиГСМ.Остатки(&Дата, Бак В (&Баки)) КАК новаОстаткиГСМОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	новаОстаткиГСМОстатки.Бак"
	;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Функция возвращает выборку остатков ГСМ для баков, заданных в списке на момент,
// предшедствующий указанному путевому листу за вычетом заправок под этот лист
//
// Параматры:
//  ПутевойЛист - объект документа Путевой лист
//  мсБаки - <Массив> - массив баков транспорта, для которых требуется сформировать выборку
//
// Возвращаемое значение:
//  <ВыборкаИзРезультатаЗапроса>
//
Функция ПолучитьВыборкуОстатковГСМДляПутевки(ПутевойЛист, мсБаки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Баки",мсБаки);
	Запрос.УстановитьПараметр("Дата",Новый Граница(ПутевойЛист.Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПутевойЛист",ПутевойЛист.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(новаОстаткиГСМ.Количество) КАК Количество,
	|	новаОстаткиГСМ.Бак
	|ПОМЕСТИТЬ ЗаправкиПодПутевку
	|ИЗ
	|	РегистрНакопления.новаОстаткиГСМ КАК новаОстаткиГСМ
	|ГДЕ
	|	новаОстаткиГСМ.Бак В(&Баки)
	|	И новаОстаткиГСМ.ПутевойЛист = &ПутевойЛист
	|
	|СГРУППИРОВАТЬ ПО
	|	новаОстаткиГСМ.Бак
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	новаОстаткиГСМОстатки.Бак,
	|	СУММА(новаОстаткиГСМОстатки.КоличествоОстаток - ЕстьNULL(ЗаправкиПодПутевку.Количество,0)) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.новаОстаткиГСМ.Остатки(&Дата, Бак В (&Баки)) КАК новаОстаткиГСМОстатки
	|		Левое СОЕДИНЕНИЕ ЗаправкиПодПутевку КАК ЗаправкиПодПутевку
	|		ПО новаОстаткиГСМОстатки.Бак = ЗаправкиПодПутевку.Бак
	|
	|СГРУППИРОВАТЬ ПО
	|	новаОстаткиГСМОстатки.Бак"
	;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Функция возвращает таблицу путевых листов автомобиля за указанный период
//
// Параматры:
//  Транспорт - автомобиль, путевые листы которого требуется получить
//  ДатаНачалаПоиска    - начало периода поиска
//  ДатаОкончанияПоиска - конец периода поиска
//
// Возвращаемое значение:
//  <ТаблицаЗначений>
//
Функция ПолучитьТаблицуПутевыхЛистов(Транспорт, ДатаНачалаПоиска, ДатаОкончанияПоиска) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Транспорт",Транспорт);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНачалаПоиска);
	Запрос.УстановитьПараметр("ДатаКон",ДатаОкончанияПоиска);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	новаПутевойЛист.Ссылка КАК ПутевойЛист,
	|	новаРейсМестнойДоставки.Водитель КАК Водитель
	|ИЗ
	|	БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаПутевойЛист КАК новаПутевойЛист
	|		ПО новаРейсМестнойДоставки.ПутевойЛист = новаПутевойЛист.Ссылка
	|ГДЕ
	|	(НЕ новаПутевойЛист.ПометкаУдаления)
	|	И новаПутевойЛист.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И новаРейсМестнойДоставки.Транспорт = &Транспорт
	|
	|УПОРЯДОЧИТЬ ПО
	|	новаПутевойЛист.Дата УБЫВ"
	;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция расчитывает норму расхода гсм
//
// Параматры:
//  Документ - документ, на основании которого производится расчет нормы
//  Нормы    - структура норм
//
// Возвращаемое значение:
//  <Число>
//
Функция РасчитатьНормуРасходаГСМ(ПутевойЛистОбъект, Нормы) Экспорт
	
	Норма  = 0;
	
	// Расчет нормы на пробег по линейной норме
	Пробег = ПолучитьРеквизитРейсаПутевогоЛиста(ПутевойЛистОбъект.Ссылка, "РасстояниеФакт");
	Пробег = ?(Пробег=Неопределено,0,Пробег);
	Норма  = Норма  + ?(Нормы.ЛинейнаяНорма=0,0,Пробег / 100 * Нормы.ЛинейнаяНорма);
	
	// Расчет нормы на перевозимый груз
	Норма  = Норма  + ПутевойЛистОбъект.КоличествоКилометроТонн * Нормы.НормаНаИзменениеСобственногоВеса / 100;
	
	// Расчет нормы на прицепы как перевозимый груз
	ВесПрицепов = 0;
	Если ЗначениеЗаполнено(ПутевойЛистОбъект.Прицеп1) Тогда
		ВесПрицепов = ВесПрицепов + ПутевойЛистОбъект.Прицеп1.СобственныйВес;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПутевойЛистОбъект.Прицеп2) Тогда
		ВесПрицепов = ВесПрицепов + ПутевойЛистОбъект.Прицеп2.СобственныйВес;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПутевойЛистОбъект.Прицеп3) Тогда
		ВесПрицепов = ВесПрицепов + ПутевойЛистОбъект.Прицеп3.СобственныйВес;
	КонецЕсли;
	
	Если ВесПрицепов <> 0 Тогда
		Норма  = Норма + ВесПрицепов * Пробег / 100 * Нормы.НормаНаИзменениеСобственногоВеса;	
	КонецЕсли;
	                                                 
	// Расчет нормы на запуск                                        
	Норма  = Норма + Нормы.НормаНаЗапуск;	
	
	// Расчет нормы на моточасы  
	Норма  = Норма + ПутевойЛистОбъект.КоличествоМоточасов * Нормы.НормаНаМоточас;	
	
	// Расчет нормы на операции                            
	Норма  = Норма + ПутевойЛистОбъект.КоличествоОпераций * Нормы.НормаНаОперацию;	
	                                                                
	// Расчет нормы на ездки
	Норма  = Норма + ПутевойЛистОбъект.КоличествоЕздок * Нормы.НормаНаЕздку;	
	
	Возврат Норма;
	
КонецФункции
                                                                                                
// Возвращает реквизит путевого листа
//
// Параметры:
//  ПутевойЛист  <ДокументОбъект.новаПутевойЛист>:
//  ИмяРеквизита <Строка>
//
// Возвращаемое значение:
//  <Произвольный>
//
Функция ПолучитьРеквизитРейсаПутевогоЛиста(ПутевойЛист, ИмяРеквизита) Экспорт            
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПутевойЛист",ПутевойЛист);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	новаРейсМестнойДоставки."+ИмяРеквизита+" 
	|ИЗ
	|	БизнесПроцесс.новаРейсМестнойДоставки КАК новаРейсМестнойДоставки
	|ГДЕ
	|	новаРейсМестнойДоставки.ПутевойЛист = &ПутевойЛист"
	;
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат рез.Выгрузить()[0][ИмяРеквизита];
	КонецЕсли;
	
КонецФункции

// Вывод предупреждений пользователю о логической незаполненности элемента транспорта в части учета ГСМ
//
// Параметры: 
//  ТранспортОбъект - объект справочника новаТранспорт
//
Процедура АнализПолнотыДанныхГСМТранспорта(Транспорт, ПредупреждатьОбОтсутствииБакаДляНормыМодели = Истина) Экспорт 
	#Если Клиент Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(новаНормыРасходаГСМСрезПоследних.ГСМ) КАК ГСМНорма,
	|	ПРЕДСТАВЛЕНИЕ(БакиТранспорта.ОсновнойГСМ) КАК ГСМБак
	|ИЗ
	|	РегистрСведений.новаНормыРасходаГСМ.СрезПоследних(
	|			&Дата,
	|			ВЫБОР
	|				КОГДА &ИндивидуальныеНормы = Истина
	|					ТОГДА МаркаТранспорт = &Транспорт
	|				ИНАЧЕ МаркаТранспорт = &Модель
	|			КОНЕЦ) КАК новаНормыРасходаГСМСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			новаБакиТранспорта.Ссылка КАК Ссылка,
	|			новаБакиТранспорта.ОсновнойГСМ КАК ОсновнойГСМ
	|		ИЗ
	|			Справочник.новаБакиТранспорта КАК новаБакиТранспорта
	|		ГДЕ
	|			новаБакиТранспорта.Владелец = &Транспорт) КАК БакиТранспорта
	|		ПО новаНормыРасходаГСМСрезПоследних.ГСМ = БакиТранспорта.ОсновнойГСМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	новаНормыРасходаГСМСрезПоследних.ГСМ"
	;
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Транспорт",Транспорт);
	Запрос.УстановитьПараметр("Модель",Транспорт.Марка);
	Запрос.УстановитьПараметр("ИндивидуальныеНормы",Транспорт.ИндивидуальныеНормы);
	
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	ТабРезультат.Свернуть("ГСМБак,ГСМНорма","");
	Для Каждого СтрокаРезультат Из ТабРезультат Цикл
		Если СтрокаРезультат.ГСМНорма = NULL Тогда
			Сообщить(" У транспорта есть баки с топливом "+СтрокаРезультат.ГСМБак+" для которого не введены нормы расхода ГСМ на текущую дату!");
		ИначеЕсли СтрокаРезультат.ГСМБак = NULL Тогда
			Если Транспорт.ИндивидуальныеНормы Или ПредупреждатьОбОтсутствииБакаДляНормыМодели Тогда
				Сообщить(" Для " + ?(Транспорт.ИндивидуальныеНормы,"","марки ")+"транспорта есть введены нормы расхода для топлива "+СтрокаРезультат.ГСМНорма+", но нет введенных баков для этого вида ГСМ!");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#КонецЕсли 
КонецПроцедуры

// Находит в структуре и возвращает объект типа Документ.новаПутевойЛистОбъект
Функция ПолучитьКлючЗначениеПутевойЛистИзРасширенияФормы(Форма) Экспорт
	
	Для Каждого КлючЗначение Из Форма.Расширение Цикл
		Если ТипЗнч(КлючЗначение.Значение) = Тип("ДокументОбъект.новаПутевойЛист") Тогда
			Возврат КлючЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
